app/controllers/judgments_controller.rb

  def index
    @judgments = Judgment.all
---
SELECT "judgments".* FROM "judgments"