app/controllers/presents_controller.rb

  def index
    # We know that User.toys correctly selects the toys through presents
    @dummy_presents  = current_user.presents
    @dummy_presents.each do |dummy_present|
---
SELECT "presents".* FROM "presents"