app/controllers/toys_controller.rb

  def index
    @toys = Toy.all
---
SELECT "toys".* FROM "toys"