app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

      if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "sdfsd"], ["password_digest", "sdfds"], ["created_at", "2015-11-07 23:06:58.635448"], ["updated_at", "2015-11-07 23:06:58.635448"]]